'use strict';

/**
 * 正则表达式
 */
module.exports = {

  // 数字类型
  number: /^\d+$/,

  // 网址
  uri: /^((https|http|ftp|rtsp|mms)?:\/\/)[^\s]+$/,

  // 国内手机号码
  mobile: /^0?(13|14|15|18)[0-9]{9}$/,

  // Email邮箱
  email: /^\w[-\w.+]*@([A-Za-z0-9][-A-Za-z0-9]+\.)+[A-Za-z]{2,14}$/,

  // 邮政编码
  postalcode: /^\d{6}$/,

  // IP地址
  ip: /^(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)$/,

  // 身份证
  idcard: /^\d{17}[\d|x]|\d{15}$/,

  // 金额验证
  amount: /^(?!0+(?:\.0+)?$)(?:[1-9]\d*|0)(?:\.\d{1,2})?$/,

};
